In [135]:
#pip install pandas

In [1]:
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

Pandas is an open-source data manipulation and analysis library for Python. It provides data structures for efficiently handling large datasets and tools for working with structured data. Here's an overview of key aspects of the Pandas library:

1. Data Structures:

Series: A one-dimensional array capable of holding any data type. It's similar to a column in a spreadsheet or a single variable in statistics.

DataFrame: A two-dimensional table with rows and columns. It can be thought of as a spreadsheet or SQL table, where each column can be a different data type.

2. Data Loading and Saving:

Pandas provides functions to read data from various file formats such as CSV, Excel, SQL databases, JSON, and more.

It also allows you to write data back to these formats.

3. Data Cleaning and Preparation:

Pandas offers powerful tools for cleaning and preparing data, including handling missing values, filtering, sorting, and merging datasets.

Methods like dropna(), fillna(), and duplicated() are commonly used for data cleaning.

4. Indexing and Selecting Data:

Pandas uses labels for indexing and selecting data. The loc and iloc attributes are commonly used for label-based and integer-based indexing, respectively.

Conditional indexing is a powerful feature for selecting specific subsets of data.

5. Operations and Transformations:

Pandas supports element-wise operations between series and dataframes, similar to NumPy.

It provides various statistical and mathematical operations, along with methods like groupby for aggregating data.

6. Visualization:

While Pandas itself is not a visualization library, it integrates well with Matplotlib and Seaborn for creating visualizations.

DataFrames have built-in plotting methods for quick exploratory data visualization.

7. Integration with Other Libraries:

Pandas is often used in conjunction with other libraries like NumPy, Matplotlib, and Scikit-Learn to form a powerful data analysis and machine learning toolkit.

8. Use Cases:

Pandas is widely used for data cleaning, exploration, and analysis in fields such as finance, economics, social sciences, and more.

It is a foundational tool for data scientists, analysts, and researchers working with structured data.

Pandas is a versatile library that plays a crucial role in the Python ecosystem for data analysis. Its flexibility and ease of use make it a popular choice for handling and analyzing tabular data.

Series:

A Series is a one-dimensional array-like object in Pandas.

It is similar to a column in a spreadsheet or a single variable in statistics.

Each element in a Series has an associated index, which can be explicitly set or is automatically generated.

You can create a Series from a Python list, NumPy array, or dictionary.

### 1. Series 
A Pandas  Series  is a one-dimensional array of indexed data. 
#### Syntax : pd.Series(data, index=index)

In [137]:
import pandas as pd
from pandas import pandas
from pandas import *
import pandas

import numpy as np

In [138]:
# Creating a Series from a list
s = pd.Series([1, 3, 5, None, 6, 8], index=['a', 'b', 'c', 'd', 'e', 'f'])
s
#In this example, the index is automatically generated, and the data consists of integers and a NaN (representing a missing value).

a   1.00
b   3.00
c   5.00
d    NaN
e   6.00
f   8.00
dtype: float64

In [139]:
s.describe().T # statstical discription

count   5.00
mean    4.60
std     2.70
min     1.00
25%     3.00
50%     5.00
75%     6.00
max     8.00
dtype: float64

In [140]:
s.info() # information of the dataset

<class 'pandas.core.series.Series'>
Index: 6 entries, a to f
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      float64
dtypes: float64(1)
memory usage: 268.0+ bytes

DataFrame:

A DataFrame is a two-dimensional table with rows and columns, similar to a spreadsheet or a SQL table.

It is the primary data structure in Pandas and is used for most data manipulation and analysis tasks.

Each column in a DataFrame is a Series.

DataFrame allows you to handle heterogeneous data types and supports a wide range of operations.

### 2. Dataframes

An effective object/data structure offered by PANDAS that allows us to handle the tabular form of data(which is basically what we get to work with on a day to day basis)

#### Syntax : pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)

In [141]:
# Creating a DataFrame from a dictionary
# Sample data for the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ivan', 'Jack', 'Ivan', 'Jack', 'Grace', 'Hannah'],  
    'Age': [45, 58, 60, 28, 49, 67, None, 60, 37, 31, 37, 31, 29, 60],  
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Paris', 'Berlin', 'New York', 'Tokyo', 'London', 'Tokyo', 'London', 'Berlin', 'New York'],  
    'Salary': [95445, 86235, 62330, 46022, 65999, 88320, 57141, 65413, 87016, 58725, 87016, 58725, 57141, None],  
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10', '2023-01-09', '2023-01-10', '2023-01-07', '2023-01-08'],  
    'Category': ['A', 'B', 'C', 'A', 'B', 'A', 'C', 'B', 'A', 'B', 'A', 'B', None, 'B']  
}

df = pd.DataFrame(data)
df

       Name   Age      City   Salary        Date Category
0     Alice 45.00  New York 95445.00  2023-01-01        A
1       Bob 58.00    London 86235.00  2023-01-02        B
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C
3     David 28.00     Paris 46022.00  2023-01-04        A
4       Eva 49.00    Berlin 65999.00  2023-01-05        B
5     Frank 67.00     Paris 88320.00  2023-01-06        A
6     Grace   NaN    Berlin 57141.00  2023-01-07        C
7    Hannah 60.00  New York 65413.00  2023-01-08        B
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A
9      Jack 31.00    London 58725.00  2023-01-10        B
10     Ivan 37.00     Tokyo 87016.00  2023-01-09        A
11     Jack 31.00    London 58725.00  2023-01-10        B
12    Grace 29.00    Berlin 57141.00  2023-01-07     None
13   Hannah 60.00  New York      NaN  2023-01-08        B

In [142]:
# Set pandas to display all rows
pd.set_option('display.max_rows', None)

# Set pandas to display all columns
pd.set_option('display.max_columns', None)

In [143]:
df.head()

      Name   Age      City   Salary        Date Category
0    Alice 45.00  New York 95445.00  2023-01-01        A
1      Bob 58.00    London 86235.00  2023-01-02        B
2  Charlie 60.00     Tokyo 62330.00  2023-01-03        C
3    David 28.00     Paris 46022.00  2023-01-04        A
4      Eva 49.00    Berlin 65999.00  2023-01-05        B

In [144]:
df.tail()

      Name   Age      City   Salary        Date Category
9     Jack 31.00    London 58725.00  2023-01-10        B
10    Ivan 37.00     Tokyo 87016.00  2023-01-09        A
11    Jack 31.00    London 58725.00  2023-01-10        B
12   Grace 29.00    Berlin 57141.00  2023-01-07     None
13  Hannah 60.00  New York      NaN  2023-01-08        B

In [145]:
df.to_csv('data.csv', index=False)
# df.to_excel('data.xlsx', index=False, sheet_name='Sheet1')
# df.to_json('data.json', orient='records')
# df.to_sql('my_table', engine, index=False, if_exists='replace')

In [146]:
# Reading data from a CSV file
df = pd.read_csv(r"D:\Python\Pandas\data.csv")
#df = pd.read_excel(r"D:\Python\Pandas\data.xlsx",sheet_name='Sheet1') #encoding='unicode_escape'
# pd.read_json('data.json')
# pd.read_sql(query, )
df

       Name   Age      City   Salary        Date Category
0     Alice 45.00  New York 95445.00  2023-01-01        A
1       Bob 58.00    London 86235.00  2023-01-02        B
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C
3     David 28.00     Paris 46022.00  2023-01-04        A
4       Eva 49.00    Berlin 65999.00  2023-01-05        B
5     Frank 67.00     Paris 88320.00  2023-01-06        A
6     Grace   NaN    Berlin 57141.00  2023-01-07        C
7    Hannah 60.00  New York 65413.00  2023-01-08        B
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A
9      Jack 31.00    London 58725.00  2023-01-10        B
10     Ivan 37.00     Tokyo 87016.00  2023-01-09        A
11     Jack 31.00    London 58725.00  2023-01-10        B
12    Grace 29.00    Berlin 57141.00  2023-01-07      NaN
13   Hannah 60.00  New York      NaN  2023-01-08        B

In [147]:
df1 = pd.read_csv(r"D:\Python\Pandas\IIT-NIT\iit.csv")
df1.head()

,id,year,institute_type,round_no,quota,pool,institute_short,program_name,program_duration,degree_short,category,opening_rank,closing_rank,is_preparatory
0,1,2016,IIT,6,AI,Gender-Neutral,IIT-Bombay,Aerospace Engineering,4 Years,B.Tech,GEN,838,1841,0
1,2,2016,IIT,6,AI,Gender-Neutral,IIT-Bombay,Aerospace Engineering,4 Years,B.Tech,OBC-NCL,408,1098,0
2,3,2016,IIT,6,AI,Gender-Neutral,IIT-Bombay,Aerospace Engineering,4 Years,B.Tech,SC,297,468,0
3,4,2016,IIT,6,AI,Gender-Neutral,IIT-Bombay,Aerospace Engineering,4 Years,B.Tech,ST,79,145,0
4,5,2016,IIT,6,AI,Gender-Neutral,IIT-Bombay,Aerospace Engineering,4 Years,B.Tech,GEN-PWD,94,94,0

### **Exploring Data**

In [148]:
# Display the first few rows
print(df.head(2))
# Display the last few rows
df.tail(2)

    Name   Age      City   Salary        Date Category
0  Alice 45.00  New York 95445.00  2023-01-01        A
1    Bob 58.00    London 86235.00  2023-01-02        B

      Name   Age      City   Salary        Date Category
12   Grace 29.00    Berlin 57141.00  2023-01-07      NaN
13  Hannah 60.00  New York      NaN  2023-01-08        B

In [149]:
df.shape #how many rows and columns or dimentionality

(14, 6)

In [150]:
df.size #

84

In [151]:
df.columns # Name of the columns

Index(['Name', 'Age', 'City', 'Salary', 'Date', 'Category'], dtype='object')

In [152]:
df.dtypes #Data type of the each column

Name         object
Age         float64
City         object
Salary      float64
Date         object
Category     object
dtype: object

In [153]:
# Information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      14 non-null     object
 1   Age       13 non-null     float64
 2   City      14 non-null     object
 3   Salary    13 non-null     float64
 4   Date      14 non-null     object
 5   Category  13 non-null     object
dtypes: float64(2), object(4)
memory usage: 804.0+ bytes

In [154]:
# Basic summary statistics
df.describe().T

        count     mean      std      min      25%      50%      75%      max
Age     13.00    45.54    14.16    28.00    31.00    45.00    60.00    67.00
Salary  13.00 70425.23 16018.65 46022.00 58725.00 65413.00 87016.00 95445.00

In [155]:
df.describe(include='object').T #exclude=['int', 'float']

         count unique         top freq
Name        14     10        Ivan    2
City        14      5    New York    3
Date        14     10  2023-01-09    2
Category    13      3           B    6

In [156]:
# Accessing specific columns
df['Name'] # df.Name

0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7      Hannah
8        Ivan
9        Jack
10       Ivan
11       Jack
12      Grace
13     Hannah
Name: Name, dtype: object

In [157]:
# Accessing Multiple columns
df[['Name','Age']]

       Name   Age
0     Alice 45.00
1       Bob 58.00
2   Charlie 60.00
3     David 28.00
4       Eva 49.00
5     Frank 67.00
6     Grace   NaN
7    Hannah 60.00
8      Ivan 37.00
9      Jack 31.00
10     Ivan 37.00
11     Jack 31.00
12    Grace 29.00
13   Hannah 60.00

In [158]:
df[5:10]

     Name   Age      City   Salary        Date Category
5   Frank 67.00     Paris 88320.00  2023-01-06        A
6   Grace   NaN    Berlin 57141.00  2023-01-07        C
7  Hannah 60.00  New York 65413.00  2023-01-08        B
8    Ivan 37.00     Tokyo 87016.00  2023-01-09        A
9    Jack 31.00    London 58725.00  2023-01-10        B

### **Data Cleaning and Preprocessing**

In [159]:
data = pd.DataFrame({'A': [1, 2, None, 4, None, 6, 7, 1], 'B': [7, None, 9, None, 11, None,7,7]})
data

     A     B
0 1.00  7.00
1 2.00   NaN
2  NaN  9.00
3 4.00   NaN
4  NaN 11.00
5 6.00   NaN
6 7.00  7.00
7 1.00  7.00

In [160]:
data.isnull().sum() # Finding the missing values in the dataset

A    2
B    3
dtype: int64

In [161]:
data.isna().sum() # Finding the missing values in the dataset

A    2
B    3
dtype: int64

In [162]:
data.notnull().sum() # 
data.notna().sum() #

A    6
B    5
dtype: int64

In [163]:
data.dropna() # Drop the missing values

     A    B
0 1.00 7.00
6 7.00 7.00
7 1.00 7.00

In [164]:
data.dropna(subset=['B'])

     A     B
0 1.00  7.00
2  NaN  9.00
4  NaN 11.00
6 7.00  7.00
7 1.00  7.00

In [165]:
data['A'].mean()

np.float64(3.5)

In [166]:
data['A'].fillna(data['A'].mean()) #, inplace=True

0   1.00
1   2.00
2   3.50
3   4.00
4   3.50
5   6.00
6   7.00
7   1.00
Name: A, dtype: float64

In [167]:
data['B'].interpolate() # Repalcing with the mean value of the surrounding values

0    7.00
1    8.00
2    9.00
3   10.00
4   11.00
5    9.00
6    7.00
7    7.00
Name: B, dtype: float64

In [168]:
data

     A     B
0 1.00  7.00
1 2.00   NaN
2  NaN  9.00
3 4.00   NaN
4  NaN 11.00
5 6.00   NaN
6 7.00  7.00
7 1.00  7.00

In [169]:
data['A'].fillna(method='ffill')  # forward fill

0   1.00
1   2.00
2   2.00
3   4.00
4   4.00
5   6.00
6   7.00
7   1.00
Name: A, dtype: float64

In [170]:
data['B'].fillna(method='bfill') # bacword fill

0    7.00
1    9.00
2    9.00
3   11.00
4   11.00
5    7.00
6    7.00
7    7.00
Name: B, dtype: float64

**For Dateset** 

**Finding Missing Values**

In [171]:
df.isnull().sum() # Displaying the number of not missing values in each column

Name        0
Age         1
City        0
Salary      1
Date        0
Category    1
dtype: int64

In [172]:
df.isna().sum()

Name        0
Age         1
City        0
Salary      1
Date        0
Category    1
dtype: int64

In [173]:
df.duplicated().sum() # finding the duplicates

np.int64(2)

In [174]:
df[df.duplicated()] # Displaying the Duplicates

    Name   Age    City   Salary        Date Category
10  Ivan 37.00   Tokyo 87016.00  2023-01-09        A
11  Jack 31.00  London 58725.00  2023-01-10        B

**Handling Missing Values**

In [175]:
df.Salary.mean()

np.float64(70425.23076923077)

In [176]:
# Handling missing values
#df.dropna(inplace=True)  # Drop rows with any missing values
df.Age.fillna(round(df.Age.mean()), inplace=True)
df.Salary.fillna(round(df.Salary.mean()), inplace=True)
df.Category.fillna(df.Category.mode()[0], inplace=True)
df

       Name   Age      City   Salary        Date Category
0     Alice 45.00  New York 95445.00  2023-01-01        A
1       Bob 58.00    London 86235.00  2023-01-02        B
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C
3     David 28.00     Paris 46022.00  2023-01-04        A
4       Eva 49.00    Berlin 65999.00  2023-01-05        B
5     Frank 67.00     Paris 88320.00  2023-01-06        A
6     Grace 46.00    Berlin 57141.00  2023-01-07        C
7    Hannah 60.00  New York 65413.00  2023-01-08        B
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A
9      Jack 31.00    London 58725.00  2023-01-10        B
10     Ivan 37.00     Tokyo 87016.00  2023-01-09        A
11     Jack 31.00    London 58725.00  2023-01-10        B
12    Grace 29.00    Berlin 57141.00  2023-01-07        B
13   Hannah 60.00  New York 70425.00  2023-01-08        B

In [177]:
# Removing duplicates
df.drop_duplicates(inplace=True)

In [178]:
df.duplicated().sum()

np.int64(0)

### **Str Method**

In [179]:
# Finding the unique values in a column by using Str contain Method
df['City'].str.contains('New York')

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
12    False
13     True
Name: City, dtype: bool

In [180]:
# Selecting rows where City contains 'New York'
df[df['City'].str.contains('New York', case=False)]

      Name   Age      City   Salary        Date Category
0    Alice 45.00  New York 95445.00  2023-01-01        A
7   Hannah 60.00  New York 65413.00  2023-01-08        B
13  Hannah 60.00  New York 70425.00  2023-01-08        B

In [181]:
# Select rows where City contains 'New York' or 'London'
df['City'].str.split(' ')

0     [New, York]
1        [London]
2         [Tokyo]
3         [Paris]
4        [Berlin]
5         [Paris]
6        [Berlin]
7     [New, York]
8         [Tokyo]
9        [London]
12       [Berlin]
13    [New, York]
Name: City, dtype: object

In [182]:
# Extracting the first element of the list
df['City'].str.split(' ').str.get(0)

0        New
1     London
2      Tokyo
3      Paris
4     Berlin
5      Paris
6     Berlin
7        New
8      Tokyo
9     London
12    Berlin
13       New
Name: City, dtype: object

In [183]:
# Selecting rows where the Name starts with 'A'
df[df['Name'].str.startswith('A')]

    Name   Age      City   Salary        Date Category
0  Alice 45.00  New York 95445.00  2023-01-01        A

In [184]:
# Select rows where the Name ends with 'e'
df[df['Name'].str.endswith('e')]

       Name   Age      City   Salary        Date Category
0     Alice 45.00  New York 95445.00  2023-01-01        A
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C
6     Grace 46.00    Berlin 57141.00  2023-01-07        C
12    Grace 29.00    Berlin 57141.00  2023-01-07        B

In [185]:
# Convert text to lowercase
df['Name1'] = df['Name'].str.upper() # str.lower

### **SLicing and Indexing:**

In [186]:
# Select specific columns
df[['Name']]

       Name
0     Alice
1       Bob
2   Charlie
3     David
4       Eva
5     Frank
6     Grace
7    Hannah
8      Ivan
9      Jack
12    Grace
13   Hannah

In [187]:
# Select specific columns
df[['Name', 'City']]

       Name      City
0     Alice  New York
1       Bob    London
2   Charlie     Tokyo
3     David     Paris
4       Eva    Berlin
5     Frank     Paris
6     Grace    Berlin
7    Hannah  New York
8      Ivan     Tokyo
9      Jack    London
12    Grace    Berlin
13   Hannah  New York

In [188]:
# Select rows by index
df[2:6:2]

      Name   Age    City   Salary        Date Category    Name1
2  Charlie 60.00   Tokyo 62330.00  2023-01-03        C  CHARLIE
4      Eva 49.00  Berlin 65999.00  2023-01-05        B      EVA

In [189]:
# Select rows by index
df[-6:-1:2]

     Name   Age    City   Salary        Date Category  Name1
6   Grace 46.00  Berlin 57141.00  2023-01-07        C  GRACE
8    Ivan 37.00   Tokyo 87016.00  2023-01-09        A   IVAN
12  Grace 29.00  Berlin 57141.00  2023-01-07        B  GRACE

In [190]:
# Select rows based on a condition
df[df['Age'] >= 30]

       Name   Age      City   Salary        Date Category    Name1
0     Alice 45.00  New York 95445.00  2023-01-01        A    ALICE
1       Bob 58.00    London 86235.00  2023-01-02        B      BOB
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C  CHARLIE
4       Eva 49.00    Berlin 65999.00  2023-01-05        B      EVA
5     Frank 67.00     Paris 88320.00  2023-01-06        A    FRANK
6     Grace 46.00    Berlin 57141.00  2023-01-07        C    GRACE
7    Hannah 60.00  New York 65413.00  2023-01-08        B   HANNAH
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A     IVAN
9      Jack 31.00    London 58725.00  2023-01-10        B     JACK
13   Hannah 60.00  New York 70425.00  2023-01-08        B   HANNAH

In [191]:
# Select rows based on multiple conditions
df_filtered = df[df['Age'] > 20]
df_filtered

       Name   Age      City   Salary        Date Category    Name1
0     Alice 45.00  New York 95445.00  2023-01-01        A    ALICE
1       Bob 58.00    London 86235.00  2023-01-02        B      BOB
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C  CHARLIE
3     David 28.00     Paris 46022.00  2023-01-04        A    DAVID
4       Eva 49.00    Berlin 65999.00  2023-01-05        B      EVA
5     Frank 67.00     Paris 88320.00  2023-01-06        A    FRANK
6     Grace 46.00    Berlin 57141.00  2023-01-07        C    GRACE
7    Hannah 60.00  New York 65413.00  2023-01-08        B   HANNAH
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A     IVAN
9      Jack 31.00    London 58725.00  2023-01-10        B     JACK
12    Grace 29.00    Berlin 57141.00  2023-01-07        B    GRACE
13   Hannah 60.00  New York 70425.00  2023-01-08        B   HANNAH

In [192]:
df_filtered = df[(df['Age'] > 20) & (df['Name'] == 'David')]
df_filtered

    Name   Age   City   Salary        Date Category  Name1
3  David 28.00  Paris 46022.00  2023-01-04        A  DAVID

In [193]:
df_filtered = df[df['City'].isin(['New York', 'San Francisco'])]
df_filtered

      Name   Age      City   Salary        Date Category   Name1
0    Alice 45.00  New York 95445.00  2023-01-01        A   ALICE
7   Hannah 60.00  New York 65413.00  2023-01-08        B  HANNAH
13  Hannah 60.00  New York 70425.00  2023-01-08        B  HANNAH

In [194]:
df_filtered = df.query('Age > 30')
df_filtered

       Name   Age      City   Salary        Date Category    Name1
0     Alice 45.00  New York 95445.00  2023-01-01        A    ALICE
1       Bob 58.00    London 86235.00  2023-01-02        B      BOB
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C  CHARLIE
4       Eva 49.00    Berlin 65999.00  2023-01-05        B      EVA
5     Frank 67.00     Paris 88320.00  2023-01-06        A    FRANK
6     Grace 46.00    Berlin 57141.00  2023-01-07        C    GRACE
7    Hannah 60.00  New York 65413.00  2023-01-08        B   HANNAH
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A     IVAN
9      Jack 31.00    London 58725.00  2023-01-10        B     JACK
13   Hannah 60.00  New York 70425.00  2023-01-08        B   HANNAH

In [195]:
df.query('Name == "Alice"')

    Name   Age      City   Salary        Date Category  Name1
0  Alice 45.00  New York 95445.00  2023-01-01        A  ALICE

In [196]:
df

       Name   Age      City   Salary        Date Category    Name1
0     Alice 45.00  New York 95445.00  2023-01-01        A    ALICE
1       Bob 58.00    London 86235.00  2023-01-02        B      BOB
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C  CHARLIE
3     David 28.00     Paris 46022.00  2023-01-04        A    DAVID
4       Eva 49.00    Berlin 65999.00  2023-01-05        B      EVA
5     Frank 67.00     Paris 88320.00  2023-01-06        A    FRANK
6     Grace 46.00    Berlin 57141.00  2023-01-07        C    GRACE
7    Hannah 60.00  New York 65413.00  2023-01-08        B   HANNAH
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A     IVAN
9      Jack 31.00    London 58725.00  2023-01-10        B     JACK
12    Grace 29.00    Berlin 57141.00  2023-01-07        B    GRACE
13   Hannah 60.00  New York 70425.00  2023-01-08        B   HANNAH

In [197]:
df['Name'][4]

'Eva'

In [198]:
print("befor",df['Name'][4])
df['Name'][4] = 'Roshan'
print("after",df['Name'][4])

befor Eva
after Roshan

In [199]:
df['Salary'][5] = 56000

### **Data Manipulation:**

In [200]:
print(df.loc[1]) # Accessing a row by index

Name               Bob
Age              58.00
City            London
Salary        86235.00
Date        2023-01-02
Category             B
Name1              BOB
Name: 1, dtype: object

In [201]:
print(df.loc[1, 'Name']) # indexing by loc is using index value in number and column name in string
# loc is faster than iloc

Bob

In [202]:
print(df.loc[2:3, "Name"])

2    Charlie
3      David
Name: Name, dtype: object

In [203]:
print(df.loc[2:3, "Name":"Salary"])

      Name   Age   City   Salary
2  Charlie 60.00  Tokyo 62330.00
3    David 28.00  Paris 46022.00

In [204]:
print(df.iloc[0:3])

      Name   Age      City   Salary        Date Category    Name1
0    Alice 45.00  New York 95445.00  2023-01-01        A    ALICE
1      Bob 58.00    London 86235.00  2023-01-02        B      BOB
2  Charlie 60.00     Tokyo 62330.00  2023-01-03        C  CHARLIE

In [205]:
print(df.iloc[0:3, 2]) # The indexing by iloc uses numeric index values for rows and column names

0    New York
1      London
2       Tokyo
Name: City, dtype: object

In [206]:
print(df.iloc[0:4])

      Name   Age      City   Salary        Date Category    Name1
0    Alice 45.00  New York 95445.00  2023-01-01        A    ALICE
1      Bob 58.00    London 86235.00  2023-01-02        B      BOB
2  Charlie 60.00     Tokyo 62330.00  2023-01-03        C  CHARLIE
3    David 28.00     Paris 46022.00  2023-01-04        A    DAVID

In [207]:
print(df.iloc[1 , 4])

2023-01-02

In [208]:
print(df.iloc[0:4, 0:3]) # starting index is included and ending index is excluded

      Name   Age      City
0    Alice 45.00  New York
1      Bob 58.00    London
2  Charlie 60.00     Tokyo
3    David 28.00     Paris

In [209]:
print(df.iloc[0:4:2, 0:3:2])

      Name      City
0    Alice  New York
2  Charlie     Tokyo

##### **Adding New Row**

In [210]:
df.loc[14] = {'Name':'Roshan',"Age":25,'City':'Blore','Salary':20000,'Date':'2023-01-06','Category':"B", 'Name1':"ROSHAN"}

In [211]:
df.loc[15] = ['sameer', None, 'Paris',20000, '2023-01-06','A', 'SAMEER']

In [212]:
#Droping The Column
#df.drop('Name1',axis=1, inplace=True) # columns=[' ', ' ']
df.drop(columns=['Name1'], inplace=True)

In [213]:
# Droping Row
df.drop(15, inplace=True)

### **Statstical Function**

In [214]:
print(df['Salary'].sum())
print(df['Age'].max())
print(df['Age'].min())
print(df['Salary'].count())

print(df['Age'].mean())
print(df['Salary'].median())
print(df['Age'].mode())
print(df['Salary'].std())
print(df['Salary'].var())

827892.0
67.0
25.0
13
45.76923076923077
62330.0
0   60.00
Name: Age, dtype: float64
19379.56256816271
375567445.3333333

In [215]:
np.sqrt(242274755.88322574)

np.float64(15565.177669503992)

In [216]:
np.power(2, 3)

np.int64(8)

### **Special Function**

In [217]:
df

       Name   Age      City   Salary        Date Category
0     Alice 45.00  New York 95445.00  2023-01-01        A
1       Bob 58.00    London 86235.00  2023-01-02        B
2   Charlie 60.00     Tokyo 62330.00  2023-01-03        C
3     David 28.00     Paris 46022.00  2023-01-04        A
4    Roshan 49.00    Berlin 65999.00  2023-01-05        B
5     Frank 67.00     Paris 56000.00  2023-01-06        A
6     Grace 46.00    Berlin 57141.00  2023-01-07        C
7    Hannah 60.00  New York 65413.00  2023-01-08        B
8      Ivan 37.00     Tokyo 87016.00  2023-01-09        A
9      Jack 31.00    London 58725.00  2023-01-10        B
12    Grace 29.00    Berlin 57141.00  2023-01-07        B
13   Hannah 60.00  New York 70425.00  2023-01-08        B
14   Roshan 25.00     Blore 20000.00  2023-01-06        B

In [218]:
# Converting data types
df['Age'] = df['Age'].astype('int') #int, str, float

In [219]:
#Reset The Index
df.reset_index(drop=True, inplace=True)

In [220]:
# Rename the columns
df.rename(columns={'Category': 'Cate'}, inplace=True)
df

       Name  Age      City   Salary        Date Cate
0     Alice   45  New York 95445.00  2023-01-01    A
1       Bob   58    London 86235.00  2023-01-02    B
2   Charlie   60     Tokyo 62330.00  2023-01-03    C
3     David   28     Paris 46022.00  2023-01-04    A
4    Roshan   49    Berlin 65999.00  2023-01-05    B
5     Frank   67     Paris 56000.00  2023-01-06    A
6     Grace   46    Berlin 57141.00  2023-01-07    C
7    Hannah   60  New York 65413.00  2023-01-08    B
8      Ivan   37     Tokyo 87016.00  2023-01-09    A
9      Jack   31    London 58725.00  2023-01-10    B
10    Grace   29    Berlin 57141.00  2023-01-07    B
11   Hannah   60  New York 70425.00  2023-01-08    B
12   Roshan   25     Blore 20000.00  2023-01-06    B

In [221]:
df.City.unique() # Unique values in the column

array(['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Blore'],
      dtype=object)

In [222]:
for i in df.columns:
    print(f"{i}: ", df[i].unique())

Name:  ['Alice' 'Bob' 'Charlie' 'David' 'Roshan' 'Frank' 'Grace' 'Hannah' 'Ivan'
 'Jack']
Age:  [45 58 60 28 49 67 46 37 31 29 25]
City:  ['New York' 'London' 'Tokyo' 'Paris' 'Berlin' 'Blore']
Salary:  [95445. 86235. 62330. 46022. 65999. 56000. 57141. 65413. 87016. 58725.
 70425. 20000.]
Date:  ['2023-01-01' '2023-01-02' '2023-01-03' '2023-01-04' '2023-01-05'
 '2023-01-06' '2023-01-07' '2023-01-08' '2023-01-09' '2023-01-10']
Cate:  ['A' 'B' 'C']

In [223]:
df['City'].nunique() # sum of unique values in a column

6

In [224]:
df['Age'].nlargest() #largest 5 values

5     67
2     60
7     60
11    60
1     58
Name: Age, dtype: int64

In [225]:
df.nlargest(3, 'Age') #3 largest values of Age

      Name  Age      City   Salary        Date Cate
5    Frank   67     Paris 56000.00  2023-01-06    A
2  Charlie   60     Tokyo 62330.00  2023-01-03    C
7   Hannah   60  New York 65413.00  2023-01-08    B

In [226]:
df['Age'].nsmallest() #smallest 5 value
df.nsmallest(5, "Age") #smallest 5 value

      Name  Age    City   Salary        Date Cate
12  Roshan   25   Blore 20000.00  2023-01-06    B
3    David   28   Paris 46022.00  2023-01-04    A
10   Grace   29  Berlin 57141.00  2023-01-07    B
9     Jack   31  London 58725.00  2023-01-10    B
8     Ivan   37   Tokyo 87016.00  2023-01-09    A

In [227]:
df['City'].unique()

array(['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Blore'],
      dtype=object)

In [228]:
df['City'].value_counts() # find the sum of unique values in the column

City
New York    3
Berlin      3
London      2
Tokyo       2
Paris       2
Blore       1
Name: count, dtype: int64

In [229]:
df['Cate'].value_counts() # Finding the unique value counts in the column

Cate
B    7
A    4
C    2
Name: count, dtype: int64

In [230]:
df['Age'].sort_values(ascending=False) # sort by age in descending order

5     67
7     60
11    60
2     60
1     58
4     49
6     46
0     45
8     37
9     31
10    29
3     28
12    25
Name: Age, dtype: int64

In [231]:
df.sort_values(by='Age',ascending=True) # sort by age in ascending order

       Name  Age      City   Salary        Date Cate
12   Roshan   25     Blore 20000.00  2023-01-06    B
3     David   28     Paris 46022.00  2023-01-04    A
10    Grace   29    Berlin 57141.00  2023-01-07    B
9      Jack   31    London 58725.00  2023-01-10    B
8      Ivan   37     Tokyo 87016.00  2023-01-09    A
0     Alice   45  New York 95445.00  2023-01-01    A
6     Grace   46    Berlin 57141.00  2023-01-07    C
4    Roshan   49    Berlin 65999.00  2023-01-05    B
1       Bob   58    London 86235.00  2023-01-02    B
11   Hannah   60  New York 70425.00  2023-01-08    B
2   Charlie   60     Tokyo 62330.00  2023-01-03    C
7    Hannah   60  New York 65413.00  2023-01-08    B
5     Frank   67     Paris 56000.00  2023-01-06    A

In [232]:
# Assign ranks based on Age
df['Rank'] = df['Age'].rank(ascending=False, method='average')
df

       Name  Age      City   Salary        Date Cate  Rank
0     Alice   45  New York 95445.00  2023-01-01    A  8.00
1       Bob   58    London 86235.00  2023-01-02    B  5.00
2   Charlie   60     Tokyo 62330.00  2023-01-03    C  3.00
3     David   28     Paris 46022.00  2023-01-04    A 12.00
4    Roshan   49    Berlin 65999.00  2023-01-05    B  6.00
5     Frank   67     Paris 56000.00  2023-01-06    A  1.00
6     Grace   46    Berlin 57141.00  2023-01-07    C  7.00
7    Hannah   60  New York 65413.00  2023-01-08    B  3.00
8      Ivan   37     Tokyo 87016.00  2023-01-09    A  9.00
9      Jack   31    London 58725.00  2023-01-10    B 10.00
10    Grace   29    Berlin 57141.00  2023-01-07    B 11.00
11   Hannah   60  New York 70425.00  2023-01-08    B  3.00
12   Roshan   25     Blore 20000.00  2023-01-06    B 13.00

In [233]:
(65999+57141+57141)/3

60093.666666666664

### **Data Aggregation:**

In [234]:
# Set pandas to display float values in decimal format
pd.set_option('display.float_format', '{:.2f}'.format)

In [235]:
df.groupby('City')['Salary'].sum() # group by city and get the mean of the age
# agrigation taken as sum, count, mean, median, max, min, std, var, first, last, nunique, unique, size, idxmax, idxmin

City
Berlin     180281.00
Blore       20000.00
London     144960.00
New York   231283.00
Paris      102022.00
Tokyo      149346.00
Name: Salary, dtype: float64

In [236]:
salary_analysis = df.groupby('City')['Salary'].sum() # sum of Salary for each name
print(salary_analysis.index.tolist())
print(np.round(salary_analysis.values))

['Berlin', 'Blore', 'London', 'New York', 'Paris', 'Tokyo']
[180281.  20000. 144960. 231283. 102022. 149346.]

In [237]:
df

       Name  Age      City   Salary        Date Cate  Rank
0     Alice   45  New York 95445.00  2023-01-01    A  8.00
1       Bob   58    London 86235.00  2023-01-02    B  5.00
2   Charlie   60     Tokyo 62330.00  2023-01-03    C  3.00
3     David   28     Paris 46022.00  2023-01-04    A 12.00
4    Roshan   49    Berlin 65999.00  2023-01-05    B  6.00
5     Frank   67     Paris 56000.00  2023-01-06    A  1.00
6     Grace   46    Berlin 57141.00  2023-01-07    C  7.00
7    Hannah   60  New York 65413.00  2023-01-08    B  3.00
8      Ivan   37     Tokyo 87016.00  2023-01-09    A  9.00
9      Jack   31    London 58725.00  2023-01-10    B 10.00
10    Grace   29    Berlin 57141.00  2023-01-07    B 11.00
11   Hannah   60  New York 70425.00  2023-01-08    B  3.00
12   Roshan   25     Blore 20000.00  2023-01-06    B 13.00

In [238]:
df.groupby(['Name','Cate'])['Salary'].sum() # sum of Salary for each name and Category

Name     Cate
Alice    A       95445.00
Bob      B       86235.00
Charlie  C       62330.00
David    A       46022.00
Frank    A       56000.00
Grace    B       57141.00
         C       57141.00
Hannah   B      135838.00
Ivan     A       87016.00
Jack     B       58725.00
Roshan   B       85999.00
Name: Salary, dtype: float64

In [239]:
# Calculate multiple aggregations simultaneously
df.groupby('City').agg({'Age': 'mean', 'Salary': 'sum'}).sort_values(by='Age', ascending=False).reset_index()

       City   Age    Salary
0  New York 55.00 231283.00
1     Tokyo 48.50 149346.00
2     Paris 47.50 102022.00
3    London 44.50 144960.00
4    Berlin 41.33 180281.00
5     Blore 25.00  20000.00

### **Apply Function**

In [241]:
def categorise(col):
    if col <= 12:
        return "Young"
    elif col <= 19:
        return "Tean Age"
    elif col <= 45:
        return "Youth"
    elif col <= 60:
        return "Adult"
    else:
        return "Senior"

categorise(60)

'Adult'

In [244]:
df

       Name  Age      City   Salary        Date Cate  Rank Age Category
0     Alice   45  New York 95445.00  2023-01-01    A  8.00        Youth
1       Bob   58    London 86235.00  2023-01-02    B  5.00        Adult
2   Charlie   60     Tokyo 62330.00  2023-01-03    C  3.00        Adult
3     David   28     Paris 46022.00  2023-01-04    A 12.00        Youth
4    Roshan   49    Berlin 65999.00  2023-01-05    B  6.00        Adult
5     Frank   67     Paris 56000.00  2023-01-06    A  1.00       Senior
6     Grace   46    Berlin 57141.00  2023-01-07    C  7.00        Adult
7    Hannah   60  New York 65413.00  2023-01-08    B  3.00        Adult
8      Ivan   37     Tokyo 87016.00  2023-01-09    A  9.00        Youth
9      Jack   31    London 58725.00  2023-01-10    B 10.00        Youth
10    Grace   29    Berlin 57141.00  2023-01-07    B 11.00        Youth
11   Hannah   60  New York 70425.00  2023-01-08    B  3.00        Adult
12   Roshan   25     Blore 20000.00  2023-01-06    B 13.00        Youth

In [243]:
df['Age Category'] = df['Age'].apply(categorise)

In [108]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df3 = pd.DataFrame(data)
df3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [245]:
# Define a function to double the value of each element
def double(x):
    return x*2

# Apply the function to the DataFrame, column-wise (default behavior)
result = df3.apply(double)
result

   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18

In [246]:
# Define a function to divisible by two value of each element
def div(x):
    return x%2==0

# Apply the function to the DataFrame, column-wise (default behavior)
result = df3[df3.apply(div)]
result1= df3[df3.applymap(div)]
print(result)
print(result1)

     A    B    C
0  NaN 4.00  NaN
1 2.00  NaN 8.00
2  NaN 6.00  NaN
     A    B    C
0  NaN 4.00  NaN
1 2.00  NaN 8.00
2  NaN 6.00  NaN

### **Merge or Join**

In [113]:
left_data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 28, 24],
}

left_df = pd.DataFrame(left_data)

# Sample data for right DataFrame
right_data = {
    'ID': [1, 2, 4, 5, 6],
    'City': ['New York', 'London', 'Paris', 'Berlin', 'Tokyo'],
    'Salary': [60000, 75000, 62000, 57000, 80000],
}

right_df = pd.DataFrame(right_data)

In [114]:
left_df

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   28
4   5      Eva   24

In [115]:
right_df

   ID      City  Salary
0   1  New York   60000
1   2    London   75000
2   4     Paris   62000
3   5    Berlin   57000
4   6     Tokyo   80000

In [ ]:
# Data Merging and Joining:
# Merging DataFrames based on a common column
merged_df = pd.merge(left_df, right_df, on='ID')
merged_df

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000

In [117]:
# Joining DataFrames based on the index
# Inner join on 'ID' column
result_inner = pd.merge(left_df, right_df, on='ID', how='inner')
print(result_inner)

# Left join on 'ID' column
result_left = pd.merge(left_df, right_df, on='ID', how='left')
print(result_left)

# Right join on 'ID' column
result_right = pd.merge(left_df, right_df, on='ID', how='right')
print(result_right)

# Outer join on 'ID' column
result_outer = pd.merge(left_df, right_df, on='ID', how='outer')
print(result_outer)

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000
   ID     Name  Age      City   Salary
0   1    Alice   25  New York 60000.00
1   2      Bob   30    London 75000.00
2   3  Charlie   35       NaN      NaN
3   4    David   28     Paris 62000.00
4   5      Eva   24    Berlin 57000.00
   ID   Name   Age      City  Salary
0   1  Alice 25.00  New York   60000
1   2    Bob 30.00    London   75000
2   4  David 28.00     Paris   62000
3   5    Eva 24.00    Berlin   57000
4   6    NaN   NaN     Tokyo   80000
   ID     Name   Age      City   Salary
0   1    Alice 25.00  New York 60000.00
1   2      Bob 30.00    London 75000.00
2   3  Charlie 35.00       NaN      NaN
3   4    David 28.00     Paris 62000.00
4   5      Eva 24.00    Berlin 57000.00
5   6      NaN   NaN     Tokyo 80000.00

### **Time Series Analysis**

In [250]:
import datetime
df['Date'] = pd.to_datetime(df["Date"], format="%Y-%m-%d")
print(df['Date'])

0    2023-01-01
1    2023-01-02
2    2023-01-03
3    2023-01-04
4    2023-01-05
5    2023-01-06
6    2023-01-07
7    2023-01-08
8    2023-01-09
9    2023-01-10
10   2023-01-07
11   2023-01-08
12   2023-01-06
Name: Date, dtype: datetime64[ns]

In [254]:
from datetime import date
dt = date.today().year
print(dt)

2025

In [257]:
df['Present'] = pd.date_range(start='2025-01-02', periods=13, freq='D') # freq='M', 'Y', 'W', 'H', 'T', 'S'

In [259]:
df.rename(columns={'Date':"Joining Date"}, inplace = True)

In [261]:
df['Year_exprience'] = df['Present'].dt.year - df['Joining Date'].dt.year

In [ ]:
df[df.select_dtypes(include=['int', 'float']).columns] #include  = ['int', 'float'], ['datetime'], ['object]

    Age   Salary  Rank  Year_exprience
0    45 95445.00  8.00               2
1    58 86235.00  5.00               2
2    60 62330.00  3.00               2
3    28 46022.00 12.00               2
4    49 65999.00  6.00               2
5    67 56000.00  1.00               2
6    46 57141.00  7.00               2
7    60 65413.00  3.00               2
8    37 87016.00  9.00               2
9    31 58725.00 10.00               2
10   29 57141.00 11.00               2
11   60 70425.00  3.00               2
12   25 20000.00 13.00               2

In [124]:
date_range = pd.date_range(start='2024-09-27', periods=15, freq='h') # Year = Y DaY = D Month = M Hour = H
print(date_range)

DatetimeIndex(['2024-09-27 00:00:00', '2024-09-27 01:00:00',
               '2024-09-27 02:00:00', '2024-09-27 03:00:00',
               '2024-09-27 04:00:00', '2024-09-27 05:00:00',
               '2024-09-27 06:00:00', '2024-09-27 07:00:00',
               '2024-09-27 08:00:00', '2024-09-27 09:00:00',
               '2024-09-27 10:00:00', '2024-09-27 11:00:00',
               '2024-09-27 12:00:00', '2024-09-27 13:00:00',
               '2024-09-27 14:00:00'],
              dtype='datetime64[ns]', freq='h')

In [126]:
# Creating a DataFrame with hourly data
data = {'value': [10, 20, 15, 25, 30, 35]}
index_dates = pd.date_range(start='2023-08-01', periods=6, freq='H')
df2 = pd.DataFrame(data, index=index_dates)
print(df2)
# Resample to daily frequency and calculate the mean for each day
daily_mean = df2.resample('D').mean()
print(daily_mean)

                     value
2023-08-01 00:00:00     10
2023-08-01 01:00:00     20
2023-08-01 02:00:00     15
2023-08-01 03:00:00     25
2023-08-01 04:00:00     30
2023-08-01 05:00:00     35
            value
2023-08-01  22.50

In [267]:
import calendar 
print(calendar.month(2025,1))

    January 2025
Mo Tu We Th Fr Sa Su
       1  2  3  4  5
 6  7  8  9 10 11 12
13 14 15 16 17 18 19
20 21 22 23 24 25 26
27 28 29 30 31

In [128]:
calendar.prcal(2025)

                                  2025

      January                   February                   March
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
       1  2  3  4  5                      1  2                      1  2
 6  7  8  9 10 11 12       3  4  5  6  7  8  9       3  4  5  6  7  8  9
13 14 15 16 17 18 19      10 11 12 13 14 15 16      10 11 12 13 14 15 16
20 21 22 23 24 25 26      17 18 19 20 21 22 23      17 18 19 20 21 22 23
27 28 29 30 31            24 25 26 27 28            24 25 26 27 28 29 30
                                                    31

       April                      May                       June
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
    1  2  3  4  5  6                1  2  3  4                         1
 7  8  9 10 11 12 13       5  6  7  8  9 10 11       2  3  4  5  6  7  8
14 15 16 17 18 19 20      12 13 14 15 16 17 18       9 10 11 12 13 14 15
21 22 23 24 25 26 27      19 20 21 22 23 24 25      16 17 18 19 20 21 22
28 29 30                  26 27 28 29 30 31         23 24 25 26 27 28 29
                                                    30

        July                     August                  September
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
    1  2  3  4  5  6                   1  2  3       1  2  3  4  5  6  7
 7  8  9 10 11 12 13       4  5  6  7  8  9 10       8  9 10 11 12 13 14
14 15 16 17 18 19 20      11 12 13 14 15 16 17      15 16 17 18 19 20 21
21 22 23 24 25 26 27      18 19 20 21 22 23 24      22 23 24 25 26 27 28
28 29 30 31               25 26 27 28 29 30 31      29 30

      October                   November                  December
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
       1  2  3  4  5                      1  2       1  2  3  4  5  6  7
 6  7  8  9 10 11 12       3  4  5  6  7  8  9       8  9 10 11 12 13 14
13 14 15 16 17 18 19      10 11 12 13 14 15 16      15 16 17 18 19 20 21
20 21 22 23 24 25 26      17 18 19 20 21 22 23      22 23 24 25 26 27 28
27 28 29 30 31            24 25 26 27 28 29 30      29 30 31

### **Pivote Table**

In [268]:
df

,Name,Age,City,Salary,Joining Date,Cate,Rank,Age Category,Present,Year_exprience
0,Alice,45,New York,95445.00,2023-01-01,A,8.00,Youth,2025-01-02,2
1,Bob,58,London,86235.00,2023-01-02,B,5.00,Adult,2025-01-03,2
2,Charlie,60,Tokyo,62330.00,2023-01-03,C,3.00,Adult,2025-01-04,2
3,David,28,Paris,46022.00,2023-01-04,A,12.00,Youth,2025-01-05,2
4,Roshan,49,Berlin,65999.00,2023-01-05,B,6.00,Adult,2025-01-06,2
5,Frank,67,Paris,56000.00,2023-01-06,A,1.00,Senior,2025-01-07,2
6,Grace,46,Berlin,57141.00,2023-01-07,C,7.00,Adult,2025-01-08,2
7,Hannah,60,New York,65413.00,2023-01-08,B,3.00,Adult,2025-01-09,2
8,Ivan,37,Tokyo,87016.00,2023-01-09,A,9.00,Youth,2025-01-10,2
9,Jack,31,London,58725.00,2023-01-10,B,10.00,Youth,2025-01-11,2
10,Grace,29,Berlin,57141.00,2023-01-07,B,11.00,Youth,2025-01-12,2
11,Hannah,60,New York,70425.00,2023-01-08,B,3.00,Adult,2025-01-13,2
12,Roshan,25,Blore,20000.00,2023-01-06,B,13.00,Youth,2025-01-14,2

In [129]:
df.pivot_table(index='Name', columns='Cate', values='Salary', aggfunc='sum')

Cate           A         B        C
Name
Alice   95445.00       NaN      NaN
Bob          NaN  86235.00      NaN
Charlie      NaN       NaN 62330.00
David   46022.00       NaN      NaN
Frank   56000.00       NaN      NaN
Grace        NaN  57141.00 57141.00
Hannah       NaN 135838.00      NaN
Ivan    87016.00       NaN      NaN
Jack         NaN  58725.00      NaN
Roshan       NaN  85999.00      NaN

In [130]:
cross_tab = pd.crosstab(index=[df['Name']], # First factor to compare
                        columns=df['Cate']) # the factor we want as our "column"
cross_tab

Cate     A  B  C
Name
Alice    1  0  0
Bob      0  1  0
Charlie  0  0  1
David    1  0  0
Frank    1  0  0
Grace    0  1  1
Hannah   0  2  0
Ivan     1  0  0
Jack     0  1  0
Roshan   0  2  0

In [131]:
# Ordinal Encoding
data = pd.DataFrame({'Grade': ['A', 'B', 'C', 'A', 'D']})

grade_mapping = {'A': 3, 'B': 2, 'C': 1, 'D': 0}

data['Grade_OrdinalEncoded'] = data['Grade'].map(grade_mapping)
data['Grade1'] = data['Grade'].replace({'A': 3, 'B': 2, 'C': 1, 'D': 0})
print(data)

  Grade  Grade_OrdinalEncoded  Grade1
0     A                     3       3
1     B                     2       2
2     C                     1       1
3     A                     3       3
4     D                     0       0

### **MultiIndex**

In [269]:
branch_df2 = pd.DataFrame(
 [
 [1,2,0,0],
 [3,4,0,0],
 [5,6,0,0],
 [7,8,0,0],
 ],
 index = [2019,2020,2021,2022],
 columns = pd.MultiIndex.from_product([['delhi','mumbai'],['avg_package','students']])
)
branch_df2

           delhi               mumbai
     avg_package students avg_package students
2019           1        2           0        0
2020           3        4           0        0
2021           5        6           0        0
2022           7        8           0        0

In [133]:
branch_df2.stack()

                  delhi  mumbai
2019 avg_package      1       0
     students         2       0
2020 avg_package      3       0
     students         4       0
2021 avg_package      5       0
     students         6       0
2022 avg_package      7       0
     students         8       0